Hi @ilijamt, thank you for your response, it works perfectly with the main branch!

Do you have plans for an upcoming release?

```
❯ tf apply
data.awx_credential_type.machine: Reading...
data.awx_credential_type.machine: Read complete after 0s [name=Machine]

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awx_credential.ssh will be created
  + resource "awx_credential" "ssh" {
      + cloud           = (known after apply)
      + credential_type = 1
      + id              = (known after apply)
      + inputs          = jsonencode(
            {
              + ssh_key_data        = <<-EOT
                    -----BEGIN OPENSSH PRIVATE KEY-----
                    b3BlbnNzaC1rZXktdjEAAAAABG5vbmUAAAAEbm9uZQAAAAAAAAABAAAAMwAAAAtzc2gtZW
                    QyNTUxOQAAACBdLYFzb2FiynQ5RbceWNW5zob3Bie/6y5XRILQ4GdcHAAAAJjN1xsszdcb
                    LAAAAAtzc2gtZWQyNTUxOQAAACBdLYFzb2FiynQ5RbceWNW5zob3Bie/6y5XRILQ4GdcHA
                    AAAEDcc+n3nSJxtYiAZQRy+LTHMIWNVhEurZCsrK2oauaf810tgXNvYWLKdDlFtx5Y1bnO
                    hvcGJ7/rLldEgtDgZ1wcAAAAEmlzc3VlQGF3eC1wcm92aWRlcgECAw==
                    -----END OPENSSH PRIVATE KEY-----
                EOT
              + ssh_public_key_data = <<-EOT
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIF0tgXNvYWLKdDlFtx5Y1bnOhvcGJ7/rLldEgtDgZ1wc issue@awx-provider
                EOT
              + username            = "ubuntu"
            }
        )
      + kind            = (known after apply)
      + kubernetes      = (known after apply)
      + managed         = (known after apply)
      + name            = "Test SSH keypair"
      + organization    = 2
      + team            = (known after apply)
      + user            = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

awx_credential.ssh: Creating...
awx_credential.ssh: Creation complete after 1s [name=Test SSH keypair]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

```
❯ tf apply
data.awx_credential_type.machine: Reading...
data.awx_credential_type.machine: Read complete after 0s [name=Machine]
awx_credential.ssh: Refreshing state... [name=Test SSH keypair]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so
no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```